Show / Hide Table of Contents
Class ConnectionLoadInfo
Information about connection load update
Inheritance
System.Object
ConnectionLoadInfo
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[Serializable]
[DataContract]
public class ConnectionLoadInfo
Properties
Improve this Doc   View Source
BeamMapping
BeamMapping
Declaration
public List<BeamLoadsImportMappingData> BeamMapping { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<BeamLoadsImportMappingData>
Improve this Doc   View Source
Description
Name of Weld
Declaration
[DataMember]
public string Description { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source